CSI API ETABS v1

# eWallPropType Enumeration

---

The wall property type.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public enum eWallPropType

    Public Enumeration eWallPropType

    Dim instance As eWallPropType

    public enum class eWallPropType

    type eWallPropType

Members

| Member name| Value| Description
---|---|---|---
| Specified| 1|
| AutoSelectList| 2|

Remarks

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com